// Method ... Append
// процес добавления в массив новое слово - 'styl'
let words = ["велосипед", "самокат", "ролики", "телефон", "стол", "люстра"];
const add = (word) => (words = [...words, word]);
add("styl");
console.log(words); // ["велосипед", "самокат", "ролики", "телефон", "стол", "люстра", "styl"];
// ----------------------------------------------------------------------------------------------------
// процес удаления из массив нового слово - 'самокат'
let words = ["велосипед", "самокат", "ролики", "телефон", "стол", "люстра"];
const del = (word) => (words = words.filter((elem) => elem !== word));
del("самокат");
console.log(words); // [ 'велосипед', 'ролики', 'телефон', 'стол', 'люстра' ]
// ----------------------------------------------------------------------------------------------------
// позволяет считать данные с массива
let words = ["велосипед", "самокат", "ролики", "телефон", "стол", "люстра"];
const read = () => words.forEach((elem) => console.log("Слово: " + elem));
read();
/* Слово: велосипед;
Слово: самокат;
Слово: ролики;
Слово: телефон;
Слово: стол;
Слово: люстра;
 */
// ----------------------------------------------------------------------------------------------------
let words = ["велосипед", "самокат", "ролики", "телефон", "стол", "люстра"];
const add = (word) => (words = [...words, word]);
const del = (word) => (words = words.filter((elem) => elem !== word));
const read = () => words.forEach((elem) => console.log("Слово: " + elem));
add("styl");
del("люстра");
read();
/* Слово: велосипед
Слово: самокат
Слово: ролики
Слово: телефон
Слово: стол */
// ----------------------------------------------------------------------------------------------------
Method.startsWith();
let a = "Hello";
console.log(a.startsWith("He")); // true
console.log(a.startsWith("Hh")); // false
// ----------------------------------------------------------------------------------------------------
let words = [
  "велосипед",
  "самокат",
  "ролики",
  "телефон",
  "стол",
  "люстра",
  "самолет",
];
const search = (substring) =>
  words.filter((word) => word.startsWith(substring));
console.log(search("сам")); // [ 'самокат', 'самолет' ]
console.log(search("с")); // [ 'самокат', 'стол', 'самолет' ]
